# LineScaling Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..LineScaling Property
ACADExportOptions Class See Also
---
The scaling mode for the line type. Default value is LineScaling.ViewScale.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LineScaling LineScaling { get; set; }
```

Visual Basic
---
```text
Public Property LineScaling As LineScaling
	Get
	Set
```

Visual C++
---
```text
public:
property LineScaling LineScaling {
	LineScaling get ();
	void set (LineScaling value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace